In [18]:
import pandas as pd
import numpy as np
import random

# Define column names
columns = [
    "Car_Type", "Brand", "Model", "Year", "Mileage", "Fuel_Type", "Transmission", "Color",
    "Owner", "Price", "Engine_Size", "Seats", "Doors", "Location", "High_Missing_Col"
]

# Generate random data
np.random.seed(42)

# Define categorical columns with inconsistencies
car_types = ["Sedan", "sedan", "SEDN", "SUV", "suv", "Truck", "truk", "Convertible", "Hatchback"]
brands = ["Toyota", "Honda", "Ford", "BMW", "Mercedes", "Audi"]
fuel_types = ["Petrol", "Diesel", "Electric", "Hybrid"]
transmissions = ["Manual", "Automatic"]
colors = ["Red", "Blue", "Black", "White", "Grey"]
locations = ["New York", "Los Angeles", "Chicago", "Houston", "Miami"]

# Create DataFrame with 30 rows
data = []
for _ in range(30):
    row = [
        random.choice(car_types),
        random.choice(brands),
        f"Model_{random.randint(1, 10)}",
        random.randint(2000, 2023),
        random.randint(10000, 200000),  # Mileage
        random.choice(fuel_types),
        random.choice(transmissions),
        random.choice(colors),
        random.randint(1, 5),  # Owner count
        random.choice(["10000", 15000, -5000, 20000, "25000", "invalid"]),  # Price issues
        round(random.uniform(1.0, 5.0), 1),  # Engine size
        random.randint(2, 7),  # Seats
        random.randint(2, 5),  # Doors
        random.choice(locations),
        np.nan if random.random() < 0.7 else random.choice(["A", "B", "C"])  # High missing values
    ]
    data.append(row)

# Create DataFrame
df = pd.DataFrame(data, columns=columns)

# Introduce missing values randomly
for col in random.sample(columns[:-1], 4):  # Excluding High_Missing_Col
    df.loc[df.sample(frac=0.2).index, col] = np.nan

# Introduce duplicate values
df = pd.concat([df, df.iloc[:3]], ignore_index=True)  # Adding some duplicate rows

# Convert one column to object type but containing all integers
df["Integer_As_Object"] = df["Year"].astype(str)

In [45]:
import pandas as pd
import numpy as np
import random

# Set fixed seed for reproducibility
np.random.seed(42)
random.seed(42)

# Define column names
columns = [
    "Car_Type", "Brand", "Model", "Year", "Mileage", "Fuel_Type", "Transmission", "Color",
    "Owner", "Price", "Engine_Size", "Seats", "Doors", "Location", "High_Missing_Col"
]

# Define categorical columns with inconsistencies
car_types = ["Sedan", "sedan", "SEDN", "SUV", "suv", "Truck", "truk", "Convertible", "Hatchback"]
brands = ["Toyota", "Honda", "Ford", "BMW", "Mercedes", "Audi"]
fuel_types = ["Petrol", "Diesel", "Electric", "Hybrid"]
transmissions = ["Manual", "Automatic"]
colors = ["Red", "Blue", "Black", "White", "Grey"]
locations = ["New York", "Los Angeles", "Chicago", "Houston", "Miami"]

# Create static lists of random values for reproducibility
car_type_choices = random.choices(car_types, k=30)
brand_choices = random.choices(brands, k=30)
model_choices = [f"Model_{i}" for i in range(1, 31)]
year_choices = np.random.choice(range(2000, 2024), 30, replace=True)
mileage_choices = np.random.choice(range(10000, 200000), 30, replace=True)
fuel_choices = random.choices(fuel_types, k=30)
transmission_choices = random.choices(transmissions, k=30)
color_choices = random.choices(colors, k=30)
owner_choices = np.random.choice(range(1, 6), 30, replace=True)
price_choices = random.choices(["10000", 15000, -5000, 20000, "25000", "invalid"], k=30)
engine_choices = np.round(np.random.uniform(1.0, 5.0, 30), 1)
seats_choices = np.random.choice(range(2, 8), 30, replace=True)
doors_choices = np.random.choice(range(2, 6), 30, replace=True)
location_choices = random.choices(locations, k=30)
high_missing_choices = [np.nan if i < 21 else random.choice(["A", "B", "C"]) for i in range(30)]  # 70% missing

# Create DataFrame
df = pd.DataFrame({
    "Car_Type": car_type_choices,
    "Brand": brand_choices,
    "Model": model_choices,
    "Year": year_choices,
    "Mileage": mileage_choices,
    "Fuel_Type": fuel_choices,
    "Transmission": transmission_choices,
    "Color": color_choices,
    "Owner": owner_choices,
    "Price": price_choices,
    "Engine_Size": engine_choices,
    "Seats": seats_choices,
    "Doors": doors_choices,
    "Location": location_choices,
    "High_Missing_Col": high_missing_choices
})

# Introduce missing values randomly in selected columns
missing_cols = random.sample(columns[:-1], 4)  # Excluding High_Missing_Col
for col in missing_cols:
    missing_indices = random.sample(range(30), 6)  # 20% missing values
    df.loc[missing_indices, col] = np.nan

# Introduce duplicate values
df = pd.concat([df, df.iloc[:3]], ignore_index=True)  # Adding duplicate rows

# Convert one column to object type but containing only integers
df["Integer_As_Object"] = df["Year"].astype(str)

In [46]:
df.head()

,Car_Type,Brand,Model,Year,Mileage,Fuel_Type,Transmission,Color,Owner,Price,Engine_Size,Seats,Doors,Location,High_Missing_Col,Integer_As_Object
0,Truck,Mercedes,Model_1,2006.0,166730.0,Hybrid,Manual,White,4,invalid,2.2,3,5,Houston,NaN,2006.0
1,Sedan,Mercedes,NaN,NaN,94478.0,Electric,Automatic,NaN,5,20000,1.7,3,5,Houston,NaN,nan
2,SEDN,BMW,Model_3,2014.0,NaN,Electric,Automatic,White,3,-5000,1.1,5,3,Miami,NaN,2014.0
3,SEDN,Audi,Model_4,2010.0,159503.0,Electric,Manual,Black,1,20000,2.7,6,3,New York,NaN,2010.0
4,truk,Ford,Model_5,2007.0,140523.0,Hybrid,Manual,Red,4,10000,2.6,4,4,Chicago,NaN,2007.0

## 1. check missing values   üéÄüéÄüéÄüéÄ

In [47]:
df.shape

(33, 16)

In [48]:
df.isnull().sum()

Car_Type              0
Brand                 0
Model                 7
Year                  7
Mileage               7
Fuel_Type             0
Transmission          0
Color                 7
Owner                 0
Price                 0
Engine_Size           0
Seats                 0
Doors                 0
Location              0
High_Missing_Col     24
Integer_As_Object     0
dtype: int64

In [49]:
(df.isnull().sum()/df.shape[0])*100        # percentage => (obtain/total)*100

Car_Type              0.000000
Brand                 0.000000
Model                21.212121
Year                 21.212121
Mileage              21.212121
Fuel_Type             0.000000
Transmission          0.000000
Color                21.212121
Owner                 0.000000
Price                 0.000000
Engine_Size           0.000000
Seats                 0.000000
Doors                 0.000000
Location              0.000000
High_Missing_Col     72.727273
Integer_As_Object     0.000000
dtype: float64

In [ ]:
# df["Price"].unique  => in this we understand which value is string, nan, and integer.
df["High_Missing_Col"].unique()

array([nan, 'B', 'C'], dtype=object)

In [51]:
df["High_Missing_Col"].value_counts()

High_Missing_Col
C    5
B    4
Name: count, dtype: int64

In [52]:
df["High_Missing_Col"].isnull().sum()

np.int64(24)

In [53]:
# total rows is 33 and we see that in column "High_Missing_Col" have 33 rows => 5C + 4B + 24NAN = 33

In [54]:
# we see that in column "High_Missing_Col" that 72% missing values so we need to drop this column.
df.drop(columns=["High_Missing_Col"], inplace= True)

In [55]:
df.head(5)

,Car_Type,Brand,Model,Year,Mileage,Fuel_Type,Transmission,Color,Owner,Price,Engine_Size,Seats,Doors,Location,Integer_As_Object
0,Truck,Mercedes,Model_1,2006.0,166730.0,Hybrid,Manual,White,4,invalid,2.2,3,5,Houston,2006.0
1,Sedan,Mercedes,NaN,NaN,94478.0,Electric,Automatic,NaN,5,20000,1.7,3,5,Houston,nan
2,SEDN,BMW,Model_3,2014.0,NaN,Electric,Automatic,White,3,-5000,1.1,5,3,Miami,2014.0
3,SEDN,Audi,Model_4,2010.0,159503.0,Electric,Manual,Black,1,20000,2.7,6,3,New York,2010.0
4,truk,Ford,Model_5,2007.0,140523.0,Hybrid,Manual,Red,4,10000,2.6,4,4,Chicago,2007.0

In [56]:
df.shape

(33, 15)

In [57]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33 entries, 0 to 32
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Car_Type           33 non-null     object
 1   Brand              33 non-null     object
 2   Model              26 non-null     object
 3   Year               26 non-null     float64
 4   Mileage            26 non-null     float64
 5   Fuel_Type          33 non-null     object
 6   Transmission       33 non-null     object
 7   Color              26 non-null     object
 8   Owner              33 non-null     int64
 9   Price              33 non-null     object
 10  Engine_Size        33 non-null     float64
 11  Seats              33 non-null     int64
 12  Doors              33 non-null     int64
 13  Location           33 non-null     object
 14  Integer_As_Object  33 non-null     object
dtypes: float64(3), int64(3), object(9)
memory usage: 4.0+ KB

In [58]:
df.isnull().sum()

Car_Type             0
Brand                0
Model                7
Year                 7
Mileage              7
Fuel_Type            0
Transmission         0
Color                7
Owner                0
Price                0
Engine_Size          0
Seats                0
Doors                0
Location             0
Integer_As_Object    0
dtype: int64

In [ ]:
# column "year" and "mileage" are float type.
# so first "year" and "mileage" column fill with mean.
# column "model" and "color" is object type and have string values so fill with mode.

In [ ]:
# dataset['price'].fillna(dataset['price'].mean(), inplace=True)  => if single column
# dataset[['price', 'mileage']] = dataset[['price', 'mileage']].apply(lambda col: col.fillna(col.mean())) => if more than 1 columns.
# if more than one column then you can use two methods like 1. with lambda 2. with loop.

In [59]:
cols_to_fill = ['Year', 'Mileage']  # List of columns to fill

for col in cols_to_fill:
    df[col].fillna(df[col].mean(), inplace=True)

C:\Users\Mc\AppData\Local\Temp\ipykernel_956\874545772.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].mean(), inplace=True)

In [60]:
df.isnull().sum()

Car_Type             0
Brand                0
Model                7
Year                 0
Mileage              0
Fuel_Type            0
Transmission         0
Color                7
Owner                0
Price                0
Engine_Size          0
Seats                0
Doors                0
Location             0
Integer_As_Object    0
dtype: int64

In [ ]:
# dataset['car_type'].fillna(dataset['car_type'].mode()[0], inplace=True) => if single column

In [61]:
cols_to_fill = ['Model', 'Color']  # List of columns to fill

for col in cols_to_fill:
    df[col].fillna(df[col].mode()[0], inplace=True)

C:\Users\Mc\AppData\Local\Temp\ipykernel_956\525247931.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[col].fillna(df[col].mode()[0], inplace=True)

In [62]:
df.isnull().sum()

Car_Type             0
Brand                0
Model                0
Year                 0
Mileage              0
Fuel_Type            0
Transmission         0
Color                0
Owner                0
Price                0
Engine_Size          0
Seats                0
Doors                0
Location             0
Integer_As_Object    0
dtype: int64

Good question! The reason we **use `[0]` with `mode()` but not with `mean()`** is because of the difference in their outputs:

### **1Ô∏è‚É£ `mean()` returns a single value (number)**
- `mean()` computes the average and returns **one numeric value**.
- Since it's a single value, **indexing `[0]` is unnecessary**.

‚úÖ **Example (No `[0]` needed)**  
```python
dataset['price'].fillna(dataset['price'].mean(), inplace=True)
```
---

### **2Ô∏è‚É£ `mode()` returns a Series (can have multiple values)**
- `mode()` finds the most frequently occurring value(s).
- It **returns a Series** (not a single value), because there can be multiple modes.
- To get just one mode (usually the first), we **use `[0]`**.

‚úÖ **Example (Using `[0]` to select the first mode)**  
```python
dataset['car_type'].fillna(dataset['car_type'].mode()[0], inplace=True)
```
Here, `dataset['car_type'].mode()` might return multiple values (e.g., `['Sedan', 'SUV']`), and `[0]` selects the first one.

---

### **Summary**  
| Function | Returns | `[0]` Needed? |  
|----------|---------|--------------|  
| `.mean()` | A single numeric value | ‚ùå No |  
| `.mode()` | A Series (list-like) | ‚úÖ Yes (to select the first mode) |

Let me know if you need more clarification! üöÄ

##  2. Handling duplicates    üéÄüéÄüéÄüéÄ

In [ ]:
# Find All Duplicate Rows
duplicate_rows = df[df.duplicated()]
duplicate_rows

,Car_Type,Brand,Model,Year,Mileage,Fuel_Type,Transmission,Color,Owner,Price,Engine_Size,Seats,Doors,Location,Integer_As_Object
30,Truck,Mercedes,Model_1,2006.0,166730.000000,Hybrid,Manual,White,4,invalid,2.2,3,5,Houston,2006.0
31,Sedan,Mercedes,Model_1,2012.0,94478.000000,Electric,Automatic,Black,5,20000,1.7,3,5,Houston,nan
32,SEDN,BMW,Model_3,2014.0,110032.730769,Electric,Automatic,White,3,-5000,1.1,5,3,Miami,2014.0

In [ ]:
# Find All Duplicate Rows (Including First Occurrence)
duplicate_rows = df[df.duplicated(keep= False)]
duplicate_rows

,Car_Type,Brand,Model,Year,Mileage,Fuel_Type,Transmission,Color,Owner,Price,Engine_Size,Seats,Doors,Location,Integer_As_Object
0,Truck,Mercedes,Model_1,2006.0,166730.000000,Hybrid,Manual,White,4,invalid,2.2,3,5,Houston,2006.0
1,Sedan,Mercedes,Model_1,2012.0,94478.000000,Electric,Automatic,Black,5,20000,1.7,3,5,Houston,nan
2,SEDN,BMW,Model_3,2014.0,110032.730769,Electric,Automatic,White,3,-5000,1.1,5,3,Miami,2014.0
30,Truck,Mercedes,Model_1,2006.0,166730.000000,Hybrid,Manual,White,4,invalid,2.2,3,5,Houston,2006.0
31,Sedan,Mercedes,Model_1,2012.0,94478.000000,Electric,Automatic,Black,5,20000,1.7,3,5,Houston,nan
32,SEDN,BMW,Model_3,2014.0,110032.730769,Electric,Automatic,White,3,-5000,1.1,5,3,Miami,2014.0

In [73]:
duplicate_indices = df[df.duplicated()].index
print(duplicate_indices)

Index([30, 31, 32], dtype='int64')

In [ ]:
# # Count the Total Number of Duplicates
duplicate_count = df.duplicated().sum()
print(f"Total duplicate rows: {duplicate_count}")

Total duplicate rows: 3

In [ ]:
# Count the Total Number of Duplicates
df.duplicated().sum()

np.int64(3)

In [ ]:
# remove duplicate rows
df = df.drop_duplicates()  # This removes duplicate rows and keeps the first occurrence.

In [ ]:
df.shape    # first shape is (33,15)

(30, 15)

* df = df.drop_duplicates(keep='last')  => Remove All Duplicate Rows (Keep Last Occurrence)
* df = df.drop_duplicates(keep=False)   => Remove All Duplicates (Keep None - Remove All Duplicates)
* df = df.drop_duplicates(subset=['Car_Type', 'Brand'], keep='first')  => Remove Duplicates Based on Specific Columns

## 3. Checking for Inconsistencies & Errors   üéÄüéÄüéÄüéÄ

### 3.1

* When numerical columns are stored as text (e.g., price stored as a string), it can cause errors in calculations and modeling. Here‚Äôs how to detect and fix data type mismatches in Pandas:

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 30 entries, 0 to 29
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Car_Type           30 non-null     object
 1   Brand              30 non-null     object
 2   Model              30 non-null     object
 3   Year               30 non-null     float64
 4   Mileage            30 non-null     float64
 5   Fuel_Type          30 non-null     object
 6   Transmission       30 non-null     object
 7   Color              30 non-null     object
 8   Owner              30 non-null     int64
 9   Price              30 non-null     object
 10  Engine_Size        30 non-null     float64
 11  Seats              30 non-null     int64
 12  Doors              30 non-null     int64
 13  Location           30 non-null     object
 14  Integer_As_Object  30 non-null     object
dtypes: float64(3), int64(3), object(9)
memory usage: 3.8+ KB

In [77]:
df.head(2)

,Car_Type,Brand,Model,Year,Mileage,Fuel_Type,Transmission,Color,Owner,Price,Engine_Size,Seats,Doors,Location,Integer_As_Object
0,Truck,Mercedes,Model_1,2006.0,166730.0,Hybrid,Manual,White,4,invalid,2.2,3,5,Houston,2006.0
1,Sedan,Mercedes,Model_1,2012.0,94478.0,Electric,Automatic,Black,5,20000,1.7,3,5,Houston,nan

* we see "price" and "integer_as_object" column is object type.
* so overview these two columns and handle inconsistencies and errors.

In [78]:
df["Price"].unique()

array(['invalid', 20000, -5000, '10000', 15000, '25000'], dtype=object)

In [79]:
df["Price"].value_counts()

Price
15000      7
-5000      6
10000      5
20000      5
invalid    4
25000      3
Name: count, dtype: int64

* in this "price" columns have 3 mistakes: 
1. int store as str 
2. invalid values 
3. price is negative
* because price can never be negative.

####  You can clean the price column by following these steps:

1. Convert numeric strings to integers.
2. Replace invalid values (e.g., "invalid") with NaN.
3. Convert negative prices to NaN.
4. Optionally, replace NaN values with the mean price.

In [ ]:
# Convert 'price' to numeric, coercing errors to NaN
# This converts valid numbers and replaces non-numeric values (like "N/A" or "missing") with NaN.
df['Price'] = pd.to_numeric(df['Price'], errors='coerce')  

# errors='coerce': Any value that can't be converted to a number (e.g., strings like 'abc' or symbols like '$100' if not cleaned)
#  will be replaced with NaN (Not a Number).

* pd.to_numeric(df['Price'], errors='coerce'): This function converts values in the 'Price' column to numbers.
* errors='coerce': If there are any invalid (non-numeric) values, they are replaced with NaN instead of causing an error.
* This is useful when dealing with messy data that may contain strings or other non-numeric values in a numeric column.

In [83]:
df["Price"].dtype

dtype('float64')

In [ ]:
# "price" column convert object to float and the reason is the datatye of NaN is float. 
# NaN and nan is same that represent missing values. if we drop or fill missing values with mean, median, mode
# and nan is not dropped or fill with mean then its mean that nan pass as a string values.
# df["Price"].unique  => in this we understand which value is string, nan, and integer.

In [84]:
df["Price"].isnull().sum()

np.int64(4)

In [85]:
df["Price"].unique()

array([   nan, 20000., -5000., 10000., 15000., 25000.])

In [ ]:
# Replace negative values with NaN
# This is useful for cleaning data when negative prices don't make sense in the dataset.
# df.loc[row_condition, column_name] = new_value
df.loc[df['Price'] < 0, 'Price'] = np.nan  # This finds rows where 'Price' < 0 and replaces them with NaN.

* df.loc[df['Age'] > 60, 'Category'] = 'Senior'  # Assign category based on age  

* df.loc[:, 'Price'] *= 1.1  # Increase all prices by 10%

* df.loc[df['Price'] == -20, 'Price'] = np.nan

* df['Price'] = df['Price'].replace(-20, np.nan)  => Replace specific value (-20) with NaN

In [89]:
# Fill NaN values with the mean price (ignoring NaNs)
df['Price'].fillna(df['Price'].mean(), inplace=True)

C:\Users\Mc\AppData\Local\Temp\ipykernel_956\1748839693.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Price'].fillna(df['Price'].mean(), inplace=True)

In [90]:
# Convert back to integer type
df['Price'] = df['Price'].astype(int)

In [91]:
df["Price"].dtype

dtype('int64')

In [92]:
df.isnull().sum()

Car_Type             0
Brand                0
Model                0
Year                 0
Mileage              0
Fuel_Type            0
Transmission         0
Color                0
Owner                0
Price                0
Engine_Size          0
Seats                0
Doors                0
Location             0
Integer_As_Object    0
dtype: int64

In [93]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 30 entries, 0 to 29
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Car_Type           30 non-null     object
 1   Brand              30 non-null     object
 2   Model              30 non-null     object
 3   Year               30 non-null     float64
 4   Mileage            30 non-null     float64
 5   Fuel_Type          30 non-null     object
 6   Transmission       30 non-null     object
 7   Color              30 non-null     object
 8   Owner              30 non-null     int64
 9   Price              30 non-null     int64
 10  Engine_Size        30 non-null     float64
 11  Seats              30 non-null     int64
 12  Doors              30 non-null     int64
 13  Location           30 non-null     object
 14  Integer_As_Object  30 non-null     object
dtypes: float64(3), int64(4), object(8)
memory usage: 3.8+ KB

In [ ]:
# now deal with "integer_as_object" column
df["Integer_As_Object"].unique()

array(['2006.0', 'nan', '2014.0', '2010.0', '2007.0', '2018.0', '2022.0',
       '2023.0', '2020.0', '2003.0', '2021.0', '2001.0', '2011.0',
       '2005.0', '2000.0'], dtype=object)

In [95]:
df["Integer_As_Object"].value_counts()

Integer_As_Object
nan       6
2010.0    3
2023.0    3
2020.0    3
2011.0    2
2007.0    2
2006.0    2
2001.0    2
2022.0    1
2014.0    1
2018.0    1
2021.0    1
2003.0    1
2005.0    1
2000.0    1
Name: count, dtype: int64

In [96]:
df["Integer_As_Object"].dtype

dtype('O')

* Replace string "nan" with NaN using replace().
* Convert the column to numeric using pd.to_numeric(df['column'], errors='coerce').
* Drop actual NaN values if needed.

In [97]:
# Convert 'nan' string to actual NaN
df['Integer_As_Object'] = df['Integer_As_Object'].replace('nan', np.nan)

In [ ]:
# if above not replace then errors='coerce' automatically replace non numeric valiues to nan.
# Convert the column to numeric type, setting invalid values (e.g., 'invalid') to NaN
df['Integer_As_Object'] = pd.to_numeric(df['Integer_As_Object'], errors='coerce')

In [100]:
# Remove negative values by replacing them with NaN
df.loc[df['Integer_As_Object'] < 0, 'Integer_As_Object'] = np.nan

In [101]:
df["Integer_As_Object"].isnull().sum()

np.int64(6)

In [102]:
df["Integer_As_Object"].dtype

dtype('float64')

In [106]:
# Fill NaN values with the mean price (ignoring NaNs)
df['Integer_As_Object'].fillna(df['Integer_As_Object'].mean(), inplace=True)

C:\Users\Mc\AppData\Local\Temp\ipykernel_956\1727069999.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Integer_As_Object'].fillna(df['Integer_As_Object'].mean(), inplace=True)

In [107]:
# Convert back to integer type
df['Integer_As_Object'] = df['Integer_As_Object'].astype(int)

In [108]:
df["Integer_As_Object"].dtype

dtype('int64')

In [109]:
df.isnull().sum()

Car_Type             0
Brand                0
Model                0
Year                 0
Mileage              0
Fuel_Type            0
Transmission         0
Color                0
Owner                0
Price                0
Engine_Size          0
Seats                0
Doors                0
Location             0
Integer_As_Object    0
dtype: int64

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 30 entries, 0 to 29
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Car_Type           30 non-null     object
 1   Brand              30 non-null     object
 2   Model              30 non-null     object
 3   Year               30 non-null     float64
 4   Mileage            30 non-null     float64
 5   Fuel_Type          30 non-null     object
 6   Transmission       30 non-null     object
 7   Color              30 non-null     object
 8   Owner              30 non-null     int64
 9   Price              30 non-null     int64
 10  Engine_Size        30 non-null     float64
 11  Seats              30 non-null     int64
 12  Doors              30 non-null     int64
 13  Location           30 non-null     object
 14  Integer_As_Object  30 non-null     int64
dtypes: float64(3), int64(5), object(7)
memory usage: 3.8+ KB

In [ ]:
# EXAMPLE
d = {"price": ['22', "-99",'33', 'invalid', "44", "-70", "-55", "invalid"]}
data = pd.DataFrame(d)
data

     price
0       22
1      -99
2       33
3  invalid
4       44
5      -70
6      -55
7  invalid

### METHOD 1   recommended
### ‚úÖ to conver column object to numeric
*  undertand the conversion of datatypes

In [ ]:
# actually the column "price" is int type but only due to 2 values 30000, 45000 this column move to object data type.
# when convert object to int. then all values that store as str is now store as int type.
data = {'Price': [20000, 25000, '30000', 35000, 40000, '45000', 50000, 55000]}
aa = pd.DataFrame(data)
aa.head()

   Price
0  20000
1  25000
2  30000
3  35000
4  40000

In [125]:
aa["Price"].unique()

array([20000, 25000, '30000', 35000, 40000, '45000', 50000, 55000],
      dtype=object)

In [ ]:
# aa['Price'] = aa['Price'].astype(int)  # Convert to integer    => another method
aa['Price'] = pd.to_numeric(aa['Price'])  # Convert to integer

In [128]:
aa["Price"].unique()

array([20000, 25000, 30000, 35000, 40000, 45000, 50000, 55000])

In [131]:
aa["Price"].dtypes  # Check data types

dtype('int64')

### METHOD 2
### ‚úÖ How to Identify and Convert String Values in a Numeric Column?

In [ ]:
# Sample Data 
data = {'Price': [20000, 25000, '30000', 35000, 40000, '45000', 50000, 55000]}
df = pd.DataFrame(data)
df

   Price
0  20000
1  25000
2  30000
3  35000
4  40000
5  45000
6  50000
7  55000

In [ ]:
df["Price"].unique() # in this we can easily check that 30000 and 45000 is store as a string. 
# but if rows have 2 lac then it is difficult that with this unique() method to understand 
# which 2 values is store as string.

array([20000, 25000, '30000', 35000, 40000, '45000', 50000, 55000],
      dtype=object)

In [113]:
df["Price"].value_counts()

Price
20000    1
25000    1
30000    1
35000    1
40000    1
45000    1
50000    1
55000    1
Name: count, dtype: int64

In [115]:

# Identify non-numeric values
non_numeric = df[~df['Price'].astype(str).str.isdigit()]  # Check where values are not purely digits
#print("Non-numeric values:\n", non_numeric)
non_numeric

Empty DataFrame
Columns: [Price]
Index: []

In [118]:
# Alternative Method: Using pd.to_numeric()

df['Price'] = pd.to_numeric(df['Price'], errors='coerce')  # Converts valid numbers, sets invalid ones to NaN
non_numeric = df[df['Price'].isna()]  # Get rows where conversion failed
non_numeric

Empty DataFrame
Columns: [Price]
Index: []

In [119]:
df["Price"].unique()

array([20000, 25000, 30000, 35000, 40000, 45000, 50000, 55000])

### METHOD 3
### ‚úÖ Code to Find String Values in the "Price" Column

In [144]:

# Create DataFrame
data = {'Price': [20000, 25000, '30000', 35000, 40000, '45000', 50000, 55000]}
zz = pd.DataFrame(data)

In [145]:
# Identify values that are stored as strings
string_values = zz['Price'].apply(lambda x: isinstance(x, str))
string_values

0    False
1    False
2     True
3    False
4    False
5     True
6    False
7    False
Name: Price, dtype: bool

In [146]:
# Fetch only string-stored values
string_stored_prices = zz[string_values]
string_stored_prices

   Price
2  30000
5  45000

In [147]:
print("Values stored as strings:")        
string_stored_prices

Values stored as strings:

   Price
2  30000
5  45000

In [148]:
zz["Price"].dtype

dtype('O')

In [149]:
zz.replace({'Price': {'30000': 30000, '45000': 45000}}, inplace=True)

C:\Users\Mc\AppData\Local\Temp\ipykernel_956\2684778279.py:1: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  zz.replace({'Price': {'30000': 30000, '45000': 45000}}, inplace=True)

In [150]:
zz["Price"].dtype

dtype('int64')

### ‚úÖ IF INVALID VALUES Example

In [139]:
data = {'Price': [20000, 25000, '30000', 35000, 40000, '45000meter', 50000, '55000yh']} 
zz = pd.DataFrame(data)
zz

        Price
0       20000
1       25000
2       30000
3       35000
4       40000
5  45000meter
6       50000
7     55000yh

In [143]:
zz['Price'] = pd.to_numeric(zz['Price'], errors='coerce').fillna(0).astype(int)  # Replace NaN with 0 (or any integer)

In [ ]:
zz

   Price
0  20000
1  25000
2  30000
3  35000
4  40000
5      0
6  50000
7      0

1. Convert valid numbers to integers.
2. Replace invalid values (like '45000meter') with NaN.
3. Replace NaN values with 0 (or any integer you prefer).

### ‚úÖ Handling Large Datasets (e.g., 2 Million Rows)
* If the Price column has 2 million rows, and you want to check whether only a few values are stored as strings, then:

In [ ]:
# Check how many string values exist in the column:
count_strings = df['Price'].apply(lambda x: isinstance(x, str)).sum()
print("Number of string values:", count_strings)

In [ ]:
# If only a few values are strings, print them:
if count_strings > 0:
    print("String-stored values in Price column:", df[df['Price'].apply(lambda x: isinstance(x, str))])

In [ ]:
# If all values are integers, convert the column to int:
if count_strings == 0:
    df['Price'] = df['Price'].astype(int)
    print("Price column converted to integer type.")

üîπ Final Notes
* If some values are stored as strings, the column remains object.
* If no values are stored as strings, you can safely convert the column to int type.
* This method ensures that only those few incorrect string values are identified without scanning all 2 million rows * manually! üöÄ Let me know if you need more help!

##  Incorrect Entries    üéÄüéÄüéÄüéÄ

### ‚úÖ How to Identify and Deal with Incorrect Entries in a Dataset?
* Incorrect entries occur when values don't make sense in a given context, like negative mileage, zero engine size, or unrealistic car prices. These errors can come from human mistakes, system issues, or faulty data collection.

* Step 1: Identify Incorrect Entries

In [10]:
# 1Ô∏è‚É£ Detect Negative or Unrealistic Values
# Use filtering in Pandas to find incorrect values:

import pandas as pd

# Sample dataset with incorrect values
data = {'Mileage': [15000, -20000, 30000, 18000, -5000],
        'Engine_Size': [2.0, 1.5, 0.0, 3.0, -1.0],
        'Price': [25000, 18000, 0, 50000, -10000]}  

df = pd.DataFrame(data)
df

   Mileage  Engine_Size  Price
0    15000          2.0  25000
1   -20000          1.5  18000
2    30000          0.0      0
3    18000          3.0  50000
4    -5000         -1.0 -10000

In [11]:
# Find negative mileage
invalid_mileage = df[df['Mileage'] < 0]
#print("Incorrect Mileage:\n", invalid_mileage)
invalid_mileage

   Mileage  Engine_Size  Price
1   -20000          1.5  18000
4    -5000         -1.0 -10000

In [12]:
# Find zero or negative engine sizes
invalid_engine = df[df['Engine_Size'] <= 0]
# print("Incorrect Engine Size:\n", invalid_engine)
invalid_engine

   Mileage  Engine_Size  Price
2    30000          0.0      0
4    -5000         -1.0 -10000

In [13]:
# Find zero or negative prices
invalid_price = df[df['Price'] <= 0]
#print("Incorrect Prices:\n", invalid_price)
invalid_price
# ‚úÖ This helps identify incorrect values.

   Mileage  Engine_Size  Price
2    30000          0.0      0
4    -5000         -1.0 -10000

* Step 2: Handle Incorrect Entries

In [14]:
# 1Ô∏è‚É£ Drop Invalid Rows (If Clearly Wrong)
# If values are completely incorrect (like negative prices), remove them:

df = df[df['Price'] > 0]  # Remove negative or zero prices
df

   Mileage  Engine_Size  Price
0    15000          2.0  25000
1   -20000          1.5  18000
3    18000          3.0  50000

In [15]:
df = df[df['Mileage'] >= 0]  # Remove negative mileage
df

   Mileage  Engine_Size  Price
0    15000          2.0  25000
3    18000          3.0  50000

In [ ]:
df = df[df['Engine_Size'] > 0]  # Remove zero or negative engine size. 
df

   Mileage  Engine_Size  Price
0    15000          2.0  25000
3    18000          3.0  50000

In [ ]:
#2Ô∏è‚É£ Replace with Mean/Median (If Possible to Fix)
#If values are missing or incorrect but still usable, replace them with the median or mean:
df['Mileage'] = df['Mileage'].apply(lambda x: df['Mileage'].median() if x < 0 else x)
df['Engine_Size'] = df['Engine_Size'].apply(lambda x: df['Engine_Size'].median() if x <= 0 else x)
#‚úÖ This replaces incorrect values with more reasonable ones.

In [ ]:
# df['Mileage'] = df['Mileage'].apply(lambda x: 2000 if x < 0 else x)  => You want to check each value x, 
# and if it's negative, return 2000, else return x.
# df.loc[df['Mileage'] < 0, 'Mileage'] = 2000

In [ ]:
# 3Ô∏è‚É£ Use Domain Knowledge for Correction
# If Engine_Size = 0, check if it belongs to an electric vehicle. If yes, set Engine_Size = NaN.
# If Mileage is negative, it might be a data entry error. Convert to absolute value if it makes sense:
df['Mileage'] = df['Mileage'].abs()  # Convert negatives to positives

## How to Identify and Deal with Category Standardization Issues?  üéÄüéÄüéÄüéÄ

* In datasets, categorical values may be inconsistent due to typos, case differences, or abbreviations. For example, the same car type might appear as "Sedan", "sedan", "SEDN", causing problems in analysis and modeling.

* Step 1: Identify Inconsistent Categories

In [1]:
# 1Ô∏è‚É£ Check Unique Values in a Categorical Column
# Use .unique() or .value_counts() to find inconsistencies:

import pandas as pd

# Sample dataset with inconsistent categories
data = {'Car_Type': ['Sedan', 'sedan', 'SUV', 'suv', 'Truck', 'truk', 'Hatchback', 'HATCHBACK']}
df = pd.DataFrame(data)
df.head()

  Car_Type
0    Sedan
1    sedan
2      SUV
3      suv
4    Truck

In [18]:
# Check unique values
print("Unique categories:", df['Car_Type'].unique())

Unique categories: ['Sedan' 'sedan' 'SUV' 'suv' 'Truck' 'truk' 'Hatchback' 'HATCHBACK']

In [19]:
# Count occurrences of each category
print(df['Car_Type'].value_counts())
# ‚úÖ This helps find inconsistencies like case differences ("Sedan" vs. "sedan")
#  and typos ("truk" instead of "Truck").

Car_Type
Sedan        1
sedan        1
SUV          1
suv          1
Truck        1
truk         1
Hatchback    1
HATCHBACK    1
Name: count, dtype: int64

* Step 2: Standardize Categories

In [20]:
# 1Ô∏è‚É£ Convert to Lowercase for Uniformity
# To avoid case differences, convert all values to lowercase:
df['Car_Type'] = df['Car_Type'].str.lower()
# ‚úÖ Now "Sedan" and "sedan" are treated the same.

In [23]:
# 2Ô∏è‚É£ Correct Typos Using a Dictionary (Manual Mapping)
# If there are common misspellings, replace them with correct values:

category_mapping = {
    'sedan': 'Sedan',
    'suv': 'SUV',
    'truk': 'Truck',  # Fixing typo
    'hatchback': 'Hatchback',
    'truck': 'Truck'
}

df['Car_Type'] = df['Car_Type'].replace(category_mapping)
# ‚úÖ This ensures all values are standardized correctly.

In [24]:
df["Car_Type"].unique()

array(['Sedan', 'SUV', 'Truck', 'Hatchback'], dtype=object)

In [26]:
df["Car_Type"].value_counts()

Car_Type
Sedan        2
SUV          2
Truck        2
Hatchback    2
Name: count, dtype: int64

In [25]:
df.shape

(8, 1)

In [ ]:
#3Ô∏è‚É£ Use Fuzzy Matching for Similar Words (For Large Datasets)
#If the dataset is large and has many typos, use fuzzy matching to find similar words:

from fuzzywuzzy import process

# Define correct categories
correct_categories = ["Sedan", "SUV", "Truck", "Hatchback"]

# Function to match and correct category names
def correct_category(value):
    return process.extractOne(value, correct_categories)[0]  # Find best match

df['Car_Type'] = df['Car_Type'].apply(correct_category)
#‚úÖ This automatically fixes typos and standardizes categories.